<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest Intel version of Docker, extracts it from a DMG, and creates a PKG.</string>
        <key>Identifier</key>
        <string>io.kandji.pkg.docker</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Docker</string>
            <key>APP_NAME</key>
            <string>%NAME%.app</string>
            <key>DOWNLOAD_URL</key>
            <string>https://desktop.docker.com/mac/stable/amd64/Docker.dmg</string>
            <key>CODE_SIGNATURE</key>
            <string>anchor apple generic and identifier "com.docker.docker" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "9BNSXJN65R")</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%DOWNLOAD_URL%</string>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>StopProcessingIf</string>
                <key>Arguments</key>
                <dict>
                    <key>predicate</key>
                    <string>download_changed == False</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/%APP_NAME%</string>
                    <key>requirement</key>
                    <string>%CODE_SIGNATURE%</string>
                    <key>strict_verification</key>
                    <true/>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>AppDmgVersioner</string>
                <key>Arguments</key>
                <dict>
                    <key>dmg_path</key>
                    <string>%pathname%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>AppPkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>app_path</key>
                    <string>%pathname%/%APP_NAME%</string>
                    <key>bundleid</key>
                    <string>%bundleid%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
